Repository: RedddFoxxyy/samaya
Catalog: po/*.po
Languages: et, ru

source: Productivity;Pomodoro;Timer;Time;Tracker;
et: Productivity;Pomodoro;Timer;Time;Tracker;tootlikus;tööaeg;puhkus;puhkepaus;ajakasutus;taimer;träkker;
ru: Производительность;Помидоро;Таймер;Время;Трекер;

source: Timekeeper for your tasks
et: Ajaarvestaja sinu ülesannete jaoks
ru: Хронометр для ваших задач

source: A simple, elegant, minimalist Pomodoro timer for your desktop. Designed to help you stay focused and productive, it offers a clean, distraction-free interface to manage work and break intervals with ease.
et: Lihtne, elegantne ja minimalistlik Pomodoro-stiilis taimer sinu töölauale. Loodud aitamaks sul püsida fookuses ja tootlikuna on rakendusel puhas ja müravaba kasutajaliides, mis võimaldab sul kergesti hallata tööd ja puhkepause.
ru: Простой, элегантный и минималистичный таймер Pomodoro для вашего рабочего стола. Разработанный, чтобы помочь вам оставаться сосредоточенным и продуктивным, он предлагает понятный, не отвлекающий от работы интерфейс, позволяющий с легкостью управлять работой и отдыхом.

source: Work Session
et: Töösessioon
ru: Рабочая сессия

source: Short Break
et: Lühike puhkepaus
ru: Короткий перерыв

source: Long Break
et: Pikk puhkepaus
ru: Samaya Длительный перерыв

source: Work session duration
et: Töösessiooni kestus
ru: Продолжительность рабочей сессии

source: Duration of work sessions in minutes
et: Töösessiooni kestus minutites
ru: Продолжительность рабочих сессий в минутах

source: Short break duration
et: Lühikese puhkepausi kestus
ru: Продолжительность короткого перерыва

source: Duration of short breaks in minutes
et: Lühikese puhkepausi kestus minutites
ru: Продолжительность коротких перерывов в минутах

source: Long break duration
et: Pika puhkepausi kestus
ru: Продолжительность длительного перерыва

source: Duration of long breaks in minutes
et: Pika puhkepausi kestus minutites
ru: Продолжительность длительных перерывов в минутах

source: Sessions before long break
et: Sessioone enne pikka puhkepausi
ru: Сеансы перед длительным перерывом

source: Number of work sessions to complete before a long break
et: Töösessioone enne pikemat puhkepausi
ru: Количество рабочих сессий перед длительным перерывом

source: Auto-start breaks
et: Käivita puhkepausid automaatselt
ru: Автостарт перерывов

source: Whether to automatically start the break timer when a work session ends.
et: Kas peaks puhkepausid käivitama töösessiooni lõppedes automaatselt.
ru: Следует ли автоматически запускать таймер перерыва по окончании рабочего сеанса.

source: Auto-start work sessions
et: Käivita töösessioonid automaatselt
ru: Автозапуск рабочих сеансов

source: Whether to automatically start the work timer when a break session ends.
et: Kas peaks töösessioonid käivitama puhkepausi lõppedes automaatselt.
ru: Следует ли автоматически запускать рабочий таймер по окончании сеанса перерыва.

source: Timer Durations
et: Taimeri kestused
ru: Длительность таймера

source: Set the duration (in minutes) for each routine.
et: Seadista kestus (minutites) iga ajatüübi jaoks.
ru: Установите продолжительность (в минутах) для каждого режима.

source: Work
et: Töö
ru: Работа

source: Session Cycle
et: Sessiooni tsükkel
ru: Цикл сеанса

source: Sessions before Long Break
et: Sessioone enne pikemat puhkepausi
ru: Сессии перед длительным перерывом

source: Transition Flow
ru: Переходный процесс

source: Auto Start Breaks
ru: Автозапуск прерывов

source: Automatically start break routine after work session ends.
ru: Автоматически запускать перерыв после окончания рабочего сеанса.

source: Auto Start Work
ru: Автозапуск работы

source: Automatically start work routine after break ends.
ru: Автоматически начинать рабочую рутину после окончания перерыва.

source: translator-credits
et: Priit Jõerüüt 2025
ru: ma12@rambler.ru

source: Stop
et: Peata
ru: Стоп

source: Skip Session
et: Jäta sessioon vahele
ru: Пропустить сессию

source: Resume
et: Jätka
ru: Возобновить

source: Reset Timer
et: Lähtesta taimer
ru: Сброс таймера

source: Start
et: Alusta
ru: Старт

source: Focus session complete! Time for a break.
et: Toimekas töösessioon on lõppenud! Palun puhka nüüd.
ru: Количество рабочих сессий перед длительным перерывом.

source: Break over! Time to get back to work.
et: Puhkepaus on lõppenud! Palun asu tagasi tööle.
ru: Перерыв окончен! Пора вернуться к работе.

source: Timer finished.
et: Taimer on lõpetanud.
ru: Длительность таймера.

source: Main Menu
et: Põhimenüü
ru: Главное меню

source: Pomodoro
ru: Помодоро

source: Reset
et: Lähtesta
ru: Сброс

source: _Preferences
et: _Eelistused
ru: _Предпочтения

source: _Keyboard Shortcuts
et: _Klaviatuuri kiirklahvid
ru: _Клавиатурные сочетания

source: _About Samaya
et: R_akenduse teave: Samaya
ru: _О Samaya

source: Shortcuts
et: Kiirklahvid
ru: Клавиатурные сочетания

# shortcut window
source: Show Shortcuts
et: Näita kiirklahve
ru: Показать клавиатурные сочетания

# shortcut window
source: Show Preferences
et: Näita eelistusi
ru: Показать предпочтения

# shortcut window
source: Quit
et: Välju
ru: Выйти
